-- --------------------------------------------------------
-- 主机:                           192.168.0.252
-- 服务器版本:                        8.0.20 - MySQL Community Server - GPL
-- 服务器操作系统:                      Win64
-- HeidiSQL 版本:                  11.3.0.6295
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 正在导出表  db_plum.t_sys_dict_item 的数据：~45 rows (大约)
/*!40000 ALTER TABLE `t_sys_dict_item` DISABLE KEYS */;
INSERT INTO `t_sys_dict_item` (`id`, `name`, `value`, `dict_code`, `sort`, `status`, `defaulted`, `remark`, `gmt_create`, `gmt_modified`) VALUES
	(1, '男', '1', 'gender', 1, 1, 0, NULL, '2019-05-05 13:07:52', '2019-07-02 14:23:05'),
	(2, '女', '2', 'gender', 2, 1, 0, NULL, '2019-04-19 11:33:00', '2019-07-02 14:23:05'),
	(3, '未知', '0', 'gender', 1, 1, 0, NULL, '2020-10-17 08:09:31', '2020-10-17 08:09:31'),
	(6, '密码模式', 'password', 'grant_type', 1, 1, 0, NULL, '2020-10-17 09:11:52', '2021-01-31 09:48:18'),
	(7, '授权码模式', 'authorization_code', 'grant_type', 1, 1, 0, NULL, '2020-10-17 09:12:15', '2020-12-14 10:11:00'),
	(8, '客户端模式', 'client_credentials', 'grant_type', 1, 1, 0, NULL, '2020-10-17 09:12:36', '2020-12-14 10:11:00'),
	(9, '刷新模式', 'refresh_token', 'grant_type', 1, 1, 0, NULL, '2020-10-17 09:12:57', '2021-01-08 17:33:12'),
	(10, '简化模式', 'implicit', 'grant_type', 1, 1, 0, NULL, '2020-10-17 09:13:23', '2020-12-14 10:11:00'),
	(11, '进销存', 'erp', 'micro_service', 1, 1, 0, NULL, '2021-06-17 00:14:12', '2021-06-17 00:14:12'),
	(12, '亚马逊', 'amazon', 'micro_service', 2, 1, 0, NULL, '2021-06-17 00:15:06', '2021-06-17 00:15:06'),
	(13, '系统管理', 'admin', 'micro_service', 3, 1, 0, NULL, '2021-06-17 00:15:26', '2021-06-17 00:16:18'),
	(14, '登录管理', 'auth', 'micro_service', 4, 1, 0, NULL, '2021-06-17 00:15:40', '2021-06-17 00:16:10'),
	(15, '网关', 'gateway', 'micro_service', 5, 1, 0, NULL, '2021-06-17 00:16:01', '2021-06-17 00:16:01'),
	(16, '不限', '*', 'request_method', 1, 1, 0, NULL, '2021-06-17 00:18:34', '2021-06-17 00:18:34'),
	(17, 'GET', 'GET', 'request_method', 2, 1, 0, NULL, '2021-06-17 00:18:55', '2021-06-17 00:18:55'),
	(18, 'POST', 'POST', 'request_method', 3, 1, 0, NULL, '2021-06-17 00:19:06', '2021-06-17 00:19:06'),
	(19, 'PUT', 'PUT', 'request_method', 4, 1, 0, NULL, '2021-06-17 00:19:17', '2021-06-17 00:19:17'),
	(20, 'DELETE', 'DELETE', 'request_method', 5, 1, 0, NULL, '2021-06-17 00:19:30', '2021-06-17 00:19:30'),
	(21, 'PATCH', 'PATCH', 'request_method', 6, 1, 0, NULL, '2021-06-17 00:19:42', '2021-06-17 00:19:42'),
	(22, '启用', '0', 'user_status', 1, 1, 0, '', '2022-09-29 11:46:08', '2022-09-29 11:46:08'),
	(23, '停用', '1', 'user_status', 1, 1, 0, '', '2022-09-29 11:46:24', '2022-09-29 11:46:24'),
	(24, '过期', '2', 'user_status', 1, 1, 0, '', '2022-09-29 11:46:40', '2022-09-29 11:46:40'),
	(25, '只能查看自己负责的产品', 'onwer', 'limit_data_type', 1, 1, 0, '', '2022-10-13 15:35:20', '2022-10-13 15:35:20'),
	(26, '只能查看自己运营的产品', 'operations', 'limit_data_type', 1, 1, 0, '', '2022-10-13 15:35:56', '2022-10-13 15:35:56'),
	(1581888203172413441, '亚马逊订单、亚马逊配送', 'amz_fba', 'salesChannel', 1, 1, 0, '', '2022-10-17 14:01:52', '2022-10-17 14:01:52'),
	(1581888260445634561, '亚马逊订单、卖家自配送', 'amz_byself', 'salesChannel', 2, 1, 0, '', '2022-10-17 14:02:06', '2022-10-17 14:02:06'),
	(1581888320076054529, '非亚马逊订单、亚马逊FBA配送', 'unamz_fba', 'salesChannel', 3, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581888538905477122, '专业卖家（全球开店）', 'profession', 'sellerplan', 1, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581888617208938498, '个人卖家', 'person', 'sellerplan', 2, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581888830808064001, '手动输入', 'manually', 'shipmentstyle', 1, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581888899045195777, '根据产品重量计算', 'weight', 'shipmentstyle', 2, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581888956754624513, '根据产品重量与材积重量大者计算', 'dim_weight', 'shipmentstyle', 3, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581889240427986946, '亚马逊配送', 'AMAZON', 'isfba', 1, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581889289572646913, '卖家自配送', 'DEFAULT', 'isfba', 1, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581889946530676737, 'Pending', 'Pending', 'order_status', 1, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581889989820088321, 'Unshipped', 'Unshipped', 'order_status', 2, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581890027619155970, 'Shipped', 'Shipped', 'order_status', 3, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581890075367112705, 'Cancelled', 'Cancelled', 'order_status', 4, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581890341944492033, '企业买家', 'true', 'is_business_order', 1, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581890392456495106, '个人买家', 'false', 'is_business_order', 2, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581890576955539458, '供应商', 'supplier', 'customer', 1, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581890632278409218, '采购商', 'purchaser', 'customer', 2, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581890814340562946, '根据产品体积计算', 'volume', 'shipmentstyle', 4, 1, 0, '', '2022-10-17 14:02:20', '2022-10-17 14:02:20'),
	(1581907475923795969, 'Domestic Standard', 'us_std', 'logistics_us', 1, 1, 0, '', '2022-10-17 15:18:27', '2022-10-17 15:18:27'),
	(1581907542286073858, 'Domestic Expedited', 'us_exp', 'logistics_us', 2, 1, 0, '', '2022-10-17 15:18:43', '2022-10-17 15:18:43'),
	(1581907700616855553, 'International', 'us_int', 'logistics_us', 3, 1, 0, '', '2022-10-17 15:18:27', '2022-10-17 15:18:27'),
	(1581907871127896066, 'Standard Delivery UK', 'uk_std', 'logistics_uk', 1, 1, 0, '', '2022-10-17 15:18:27', '2022-10-17 15:18:27'),
	(1581907922722029570, 'Express Delivery UK', 'uk_exp', 'logistics_uk', 2, 1, 0, '', '2022-10-17 15:18:27', '2022-10-17 15:18:27'),
	(1581907973166923778, 'European Amazon.co.uk Marketplace countries', 'uk_eur', 'logistics_uk', 3, 1, 0, '', '2022-10-17 15:18:27', '2022-10-17 15:18:27'),
	(1581908033657176065, 'US (including US protectorates)', 'uk_us', 'logistics_uk', 4, 1, 0, '', '2022-10-17 15:18:27', '2022-10-17 15:18:27'),
	(1581908186447282178, 'Rest of World Amazon.co.uk Marketplace countries', 'uk_rest', 'logistics_uk', 5, 1, 0, '', '2022-10-17 15:18:27', '2022-10-17 15:18:27');
/*!40000 ALTER TABLE `t_sys_dict_item` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
