-- --------------------------------------------------------
-- 主机:                           wimoor.rwlb.rds.aliyuncs.com
-- 服务器版本:                        8.0.36 - Source distribution
-- 服务器操作系统:                      Linux
-- HeidiSQL 版本:                  12.6.0.6765
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 正在导出表  db_amazon.t_exchangerate 的数据：~31 rows (大约)
DELETE FROM `t_exchangerate`;
INSERT INTO `t_exchangerate` (`id`, `name`, `price`, `symbol`, `type`, `utctime`, `volume`) VALUES
	(444914, 'JPY', 4.961200, '日元', 'CNY(100)/JPY', '2025-06-18 00:00:00', NULL),
	(444915, 'SGD', 560.530000, '新加坡元', 'CNY(100)/SGD', '2025-06-18 00:00:00', NULL),
	(444916, 'HKD', 91.400000, '港币', 'CNY(100)/HKD', '2025-06-18 00:00:00', NULL),
	(444917, 'MOP', 88.740000, '澳门元', 'CNY(100)/MOP', '2025-06-18 00:00:00', NULL),
	(444918, 'CAD', 529.020000, '加拿大元', 'CNY(100)/CAD', '2025-06-18 00:00:00', NULL),
	(444919, 'ZAR', 40.320000, '南非兰特', 'CNY(100)/ZAR', '2025-06-18 00:00:00', NULL),
	(444920, 'NZD', 434.810000, '新西兰元', 'CNY(100)/NZD', '2025-06-18 00:00:00', NULL),
	(444921, 'AUD', 467.820000, '澳大利亚元', 'CNY(100)/AUD', '2025-06-18 00:00:00', NULL),
	(444922, 'GBP', 974.230000, '英镑', 'CNY(100)/GBP', '2025-06-18 00:00:00', NULL),
	(444923, 'DKK', 111.210000, '丹麦克朗', 'CNY(100)/DKK', '2025-06-18 00:00:00', NULL),
	(444924, 'NOK', 72.450000, '挪威克朗', 'CNY(100)/NOK', '2025-06-18 00:00:00', NULL),
	(444925, 'SEK', 75.660000, '瑞典克朗', 'CNY(100)/SEK', '2025-06-18 00:00:00', NULL),
	(444926, 'MYR', 169.230000, '林吉特', 'CNY(100)/MYR', '2025-06-18 00:00:00', NULL),
	(444927, 'BRL', 130.820000, '巴西里亚尔', 'CNY(100)/BRL', '2025-06-18 00:00:00', NULL),
	(444928, 'CHF', 882.210000, '瑞士法郎', 'CNY(100)/CHF', '2025-06-18 00:00:00', NULL),
	(444929, 'EUR', 829.320000, '欧元', 'CNY(100)/EUR', '2025-06-18 00:00:00', NULL),
	(444930, 'RUB', 9.130000, '卢布', 'CNY(100)/RUB', '2025-06-18 00:00:00', NULL),
	(444931, 'PHP', 12.730000, '菲律宾比索', 'CNY(100)/PHP', '2025-06-18 00:00:00', NULL),
	(444932, 'THB', 22.120000, '泰国铢', 'CNY(100)/THB', '2025-06-18 00:00:00', NULL),
	(444933, 'RMB', 100.000000, '人民币', 'CNY(100)/RMB', '2023-12-12 00:00:00', NULL),
	(444934, 'KRW', 0.528200, '韩国元', 'CNY(100)/KRW', '2025-06-18 00:00:00', NULL),
	(444935, 'TWD', 24.350000, '新台币', 'CNY(100)/TWD', '2025-06-18 00:00:00', NULL),
	(444936, 'USD', 717.460000, '美元', 'CNY(100)/USD', '2025-06-18 00:00:00', NULL),
	(444937, 'AED', 195.390000, '阿联酋迪拉姆', 'CNY(100)/AED', '2025-06-18 00:00:00', NULL),
	(444938, 'IDR', 0.044200, '印尼卢比', 'CNY(100)/IDR', '2025-06-18 00:00:00', NULL),
	(444939, 'INR', 8.369100, '印度卢比', 'CNY(100)/INR', '2025-06-18 00:00:00', NULL),
	(444940, 'SAR', 191.340000, '沙特里亚尔', 'CNY(100)/SAR', '2025-06-18 00:00:00', NULL),
	(444941, 'TRY', 18.230000, '土耳其里拉', 'CNY(100)/TRY', '2025-06-18 00:00:00', NULL),
	(444942, 'CNY', 100.000000, '人民币', 'CNY(100)/CNY', '2021-05-20 01:10:01', NULL),
	(444943, 'MXN', 37.300000, '墨西哥比索', 'CNY(100)/MXN', '2020-09-25 01:10:01', NULL),
	(444944, 'PLN', 157.820000, '波兰兹罗提', 'CNY(100)/PLN', '2023-03-27 09:05:34', NULL);

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
